Repository: RPMTW/RPMTW-Account-UI
Catalog: lib/l10n/app_*.arb
Languages: ja, ru, uk, zh_hant_cn, zh_hant_hk

# accountActionLogin
source: Login with this account
ja: このアカウントでログイン
ru: Войдите с этой учетной записью
uk: Увійдіть за допомогою цього облікового запису
zh_hant_hk: 使用本帳號登入

# accountActionLogout
source: Logout Account
ja: アカウントからログアウト
ru: Выход из учетной записи
uk: Вийти з облікового запису
zh_hant_hk: 登出帳號

# accountActionManage
source: Management Account
ja: 管理アカウント
ru: Управленческий счет
uk: Керувати обліковим записом
zh_hant_hk: 管理帳號

# accountAdditionalSignup
source: Please fill in this form to complete the sign up.
ja: サインアップを完了するには、このフォームに入力してください。
ru: Пожалуйста, заполните эту форму, чтобы завершить регистрацию.
uk: Будь ласка, заповніть цю форму щоб завершити реєстрацію.
zh_hant_cn: 请填写此表格以完成账号注册。
zh_hant_hk: 請填寫此表格以完成帳號註冊。

# accountAlreadyUsedEmail
source: This email address has been used.
ja: このメールアドレスは使用されています。
ru: Этот адрес электронной почты уже использовался.
uk: Ця електронна адреса вже використовується.
zh_hant_cn: 此电子邮件地址已被使用。
zh_hant_hk: 此電子郵件信箱已被使用。

# accountAuthCodeError
source: The verification code is wrong, please try again.
ja: 認証コードが正しくありません。もう一度やり直してください。
ru: Код проверки неверен, пожалуйста, попробуйте еще раз.
uk: Код підтвердження неправильний, будь ласка, спробуйте ще раз.
zh_hant_cn: 验证码错误，请再试一次。
zh_hant_hk: 驗證碼錯誤，請再試一次。

# accountAuthCodeIntro
source: A verification code has been sent to your email address, please enter the code to enable your account.
ja: 認証コードがメールアドレスに送信されました。アカウントを有効にするためにコードを入力してください。
ru: На ваш адрес электронной почты был отправлен проверочный код, пожалуйста, введите его, чтобы активировать вашу учетную запись.
uk: На вашу електронну адресу було надіслано код підтвердження, будь ласка, введіть код для підтвердження облікового запису.
zh_hant_cn: 验证码已发送至您的电子邮件地址，请输入验证码来启用您的账号。
zh_hant_hk: 驗證碼已發送至您的電子郵件信箱，請輸入驗證碼來啟用您的帳號。

# accountAuthCodeSent
source: The verification code has been sent to your email address.
ja: 認証コードがメールアドレスに送信されました。
ru: Код проверки был отправлен на ваш адрес электронной почты.
uk: Код підтвердження надіслано на вашу електронну пошту.
zh_hant_cn: 验证码已发送至您的电子邮件地址。
zh_hant_hk: 驗證碼已發送至您的電子郵件信箱。

# accountAuthCodeTitle
source: Verification Code
ja: 認証コード
ru: Проверочный код
uk: Код підтвердження
zh_hant_cn: 验证码
zh_hant_hk: 驗證碼

# accountConfirmPassword
source: Confirm password
ja: パスワードの確認
ru: Подтверждение пароля
uk: Підтвердження паролю
zh_hant_cn: 确认密码
zh_hant_hk: 確認密碼

# accountConfirmPasswordError
source: Password do not match!
ja: パスワードが一致しません。
ru: Пароль не совпадает!
uk: Паролі не збігаються!
zh_hant_cn: 密码不相符！
zh_hant_hk: 密碼不相符！

# accountCreateError
source: Create RPMTW Account Failed
ja: RPMTWアカウントの作成に失敗しました
ru: Не удалось создать учетную запись RPMTW
uk: Не вдалося створити обліковий запис RPMTW
zh_hant_cn: 建立 RPMTW 账号失败
zh_hant_hk: 建立 RPMTW 帳號失敗

# accountCreateSuccess
source: Successfully register and activate your account.
ja: 正常に登録してアカウントを有効にしました。
ru: Успешно зарегистрируйтесь и активируйте свою учетную запись.
uk: Успішно зареєстровано та активовано Ваш обліковий запис.
zh_hant_cn: 成功注册并启用账号。
zh_hant_hk: 成功註冊並啟用帳號。

# accountEmail
source: Email
ja: メール
ru: Email Электронная почта
uk: Ел. пошта
zh_hant_cn: 电子邮件
zh_hant_hk: 電子郵件

# accountInvalidEmail
source: Invalid email
ja: 無効なアドレス
ru: Неверный email
uk: Неправильна адреса електронної пошти
zh_hant_cn: 无效的电子邮件
zh_hant_hk: 無效的電子郵件

# accountLogin
source: Login
ja: ログイン
ru: Вход в систему
uk: Вхід
zh_hant_cn: 登入
zh_hant_hk: 登入

# accountLoginOther
source: Login to other accounts...
ja: 別のアカウントでログイン...
ru: Войдите в другие учетные записи...
uk: Увійти в інші облікові записи...
zh_hant_cn: 登入其他账号...
zh_hant_hk: 登入其他帳號...

# accountLoginTitle
source: Login to your RPMTW account
ja: RPMTWアカウントにログイン
ru: Войдите в свою учетную запись RPMTW
uk: Вхід в обліковий запис RPMTW
zh_hant_cn: 登入您的 RPMTW 账号
zh_hant_hk: 登入您的 RPMTW 帳號

# accountNotFound
source: Can't find your RPMTW account
ja: RPMTWアカウントが見つかりません
ru: Не можете найти свою учетную запись RPMTW
uk: Не вдалося знайти Ваш обліковий запис RPMTW
zh_hant_cn: 找不到您的 RPMTW 账号
zh_hant_hk: 找不到您的 RPMTW 帳號

# accountPassword
source: Password
ja: パスワード
ru: Пароль
uk: Пароль
zh_hant_cn: 密码
zh_hant_hk: 密碼

# accountPasswordError
source: Password error, please try again.
ja: パスワードが正しくありません。もう一度やり直してください。
ru: Ошибка пароля, пожалуйста, попробуйте еще раз.
uk: Хибний пароль. Будь ласка, спробуйте ще раз.
zh_hant_cn: 密码错误，请再试一次。
zh_hant_hk: 密碼錯誤，請再試一次。

# accountPasswordNeedsEnglish
source: Password must contain at least one letter of English.
ja: パスワードは、少なくとも1文字の英語が含まれている必要があります。
ru: Пароль должен содержать хотя бы одну английскую букву.
uk: Пароль має містити принаймні одну латинську літеру.
zh_hant_cn: 密码必须至少包含一个英文字母。
zh_hant_hk: 密碼必須至少包含一個英文字母。

# accountPasswordNeedsNumber
source: Password must contain at least one number.
ja: パスワードは、少なくとも1つの番号が含まれている必要があります。
ru: Пароль должен содержать хотя бы одну цифру.
uk: Пароль повинен містити принаймні одну цифру.
zh_hant_cn: 密码必须至少包含一个数字。
zh_hant_hk: 密碼必須至少包含一個數字。

# accountPasswordTooLong
source: Password must be less than 30 characters long.
ja: パスワードは30文字未満である必要があります。
ru: Пароль должен состоять менее чем из 30 символов.
uk: Пароль має містити не більше 30 символів.
zh_hant_cn: 密码必须少于30个字元。
zh_hant_hk: 密碼必須少於30個字元。

# accountPasswordTooShort
source: Password must be at least 6 characters long.
ja: パスワードは6文字以上にする必要があります。
ru: Пароль должен состоять не менее чем из 6 символов.
uk: Пароль має містити не менше 6 символів.
zh_hant_cn: 密码至少需要6个字元。
zh_hant_hk: 密碼至少需要6個字元。

# accountProviders
source: or login with
ja: その他でログインする
ru: или войти в систему с помощью
uk: або увійдіть через
zh_hant_cn: 或用以下方式登入
zh_hant_hk: 或用以下方式登入

# accountResendCode
source: Resend Authentication Code (WIP)
ja: 認証コードを再送信（WIP）
ru: Повторная отправка кода аутентификации (WIP)
uk: Повторно відправити код аутентифікації (В розробці)
zh_hant_cn: 重新发送验证码 （WIP）
zh_hant_hk: 重新發送驗證碼 （WIP）

# accountSelect
source: Please select an account to log in to this service...
ja: このサービスにログインするアカウントを選択してください...
ru: Пожалуйста, выберите учетную запись для входа в эту службу...
uk: Будь ласка, виберіть обліковий запис, щоб увійти в цю службу...
zh_hant_cn: 请选取账号以登入此服务...
zh_hant_hk: 請選取帳號以登入此服務...

# accountSignup
source: Signup new account
ja: 新規アカウントを登録
ru: Регистрация нового аккаунта
uk: Зареєструвати новий обліковий запис
zh_hant_cn: 注册新账号
zh_hant_hk: 註冊新帳號

# accountTitle
source: RPMTW Account
ja: RPMTWアカウント
ru: Счет RPMTW
uk: Обліковий запис RPMTW
zh_hant_cn: RPMTW 账号
zh_hant_hk: RPMTW 帳號

# accountUsername
source: Username
ja: ユーザー名
ru: Имя пользователя
uk: Ім'я користувача
zh_hant_cn: 使用者名称
zh_hant_hk: 使用者名稱

# accountUsernameError
source: User name cannot be empty.
ja: ユーザー名を空にすることはできません。
ru: Имя пользователя не может быть пустым.
uk: Ім'я користувача не може бути порожнім.
zh_hant_cn: 使用者名称不能为空。
zh_hant_hk: 使用者名稱不能為空。

# changeAvatar
source: Change your profile picture
ja: プロフィール画像を変更
ru: Измените фотографию своего профиля
uk: Змінити зображення профілю
zh_hant_hk: 更換個人資料照片

# changeAvatarUpdateSuccess
source: The change of personal data picture was successful.
ja: 個人データ画像の変更は成功しました。
ru: Изменение изображения персональных данных прошло успешно.
uk: Зміна зображення персональних даних пройшла успішно.
zh_hant_hk: 更換個人資料圖片成功。

# changeAvatarUpdating
source: Uploading pictures now...
ja: 画像をアップロードしています...
ru: Сейчас загружаю фотографии...
uk: Завантаження зображень...
zh_hant_hk: 正在上傳圖片中...

# guiBack
source: Back
ja: 戻る
ru: Назад
uk: Назад
zh_hant_cn: 返回
zh_hant_hk: 返回

# guiConfirm
source: Confirm
ja: 確認
ru: Подтвердить
uk: Підтвердити
zh_hant_hk: 確認

# guiCopyright
source: Copyright Â© RPMTW 2021-2022 Powered by The RPMTW Team.
ja: Copyright © RPMTW 2021-2022 Powered by The RPMTW Team.
uk: © RPMTW 2021-2022 Команда RPMTW та розробники. Всі права захищені.
zh_hant_cn: 版权所有 © RPMTW 2021-2022 由 RPMTW Team 提供支持。
zh_hant_hk: 版權所有 © RPMTW 2021-2022 由 RPMTW Team 提供支援。

# guiError
source: Error
ja: エラー
ru: Ошибка
uk: Помилка
zh_hant_cn: 错误
zh_hant_hk: 錯誤

# guiSubmit
source: Submit
ja: 送信
ru: Отправить
uk: Надіслати
zh_hant_cn: 送出
zh_hant_hk: 送出

# guiSuccess
source: Success
ja: 成功
ru: Успех
uk: Успішно
zh_hant_cn: 成功
zh_hant_hk: 成功

# guiWIP
source: This feature is still under development, sorry for the hassle.
ja: この機能はまだ開発中です。ご迷惑をおかけして申し訳ありません。
ru: Эта функция все еще находится в разработке, извините за беспокойство.
uk: Ця функція ще розроблюється, вибачте за складнощі.
zh_hant_cn: 此功能仍在开发中，抱歉造成您的困扰。
zh_hant_hk: 此功能仍在開發中，抱歉造成您的困擾。
